Revit 2027 API
FilledRegionType.IsValidMasking Method
 Check that in a family the FillRegionType is always masking.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidMasking(
	bool isMasking
)
Public Function IsValidMasking (
	isMasking As Boolean
) As Boolean
public:
bool IsValidMasking(
	bool isMasking
)
member IsValidMasking :
        isMasking : bool -> bool
Parameters
isMasking Boolean
 The isMasking value to check.
Return Value
Boolean
 True if the IsMasking property can be set to the new value.
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace